app/Http/Controllers/AccountsController.php

select * from `accounts` where `id_user` = 3
---
    public function index(Request $request)
    {


        $data = Account::where('id_user', Auth()->id())->get();